As a result of Reloading Latest, there are no Levels left. Create a new Level, and then Reload Latest again.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId NoLevelsLeftReloading { get; }
  Visual Basic
Public Shared ReadOnly Property NoLevelsLeftReloading As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ NoLevelsLeftReloading {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures LevelFailures Class
  Autodesk.Revit.DB Namespace